app/controllers/dishes_controller.rb

  def index
    @dishes = Dish.includes(items: [:ingredients]).all
---
SELECT "dishes".* FROM "dishes"
SELECT "ingredients".* FROM "ingredients" WHERE "ingredients"."item_id" IN (1, 2)

  def create
    @dish = Dish.new(dish_params)
    if @dish.save
---
INSERT INTO "dishes" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Dinner"], ["created_at", "2015-08-28 23:38:48.653583"], ["updated_at", "2015-08-28 23:38:48.653583"]]

  def destroy
    @dish = Dish.find(params[:id])
    @dish.destroy
---
SELECT  "dishes".* FROM "dishes" WHERE "dishes"."id" = $1 LIMIT 1  [["id", 1]]
DELETE FROM "dishes" WHERE "dishes"."id" = $1  [["id", 1]]