app/controllers/items_controller.rb

  def create
    @item = Item.new(item_params)
    @item.dish_id = params[:dish_id]
    if @item.save
      @item.create_ingredients(ingredient_params)
---
INSERT INTO "items" ("name", "dish_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Steak"], ["dish_id", 1], ["created_at", "2015-08-28 23:39:03.453436"], ["updated_at", "2015-08-28 23:39:03.453436"]]
INSERT INTO "ingredients" ("name", "quantity", "item_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "e"], ["quantity", "g"], ["item_id", 37], ["created_at", "2015-09-01 14:11:09.894913"], ["updated_at", "2015-09-01 14:11:09.894913"]]